Documents/ESB/ESB_Consumer_0728/003TestSample/SAMPLE_XML_MUST/Remittance/RE01_TWDOutWrdRmtAddRq.xml

<?xml version="1.0" encoding="utf-8"?>

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:v1="http://www.iisigroup.com/magiclamp/common/soapenv.xsd/v1" xmlns:v11="http://www.nextbank.com.tw/xsd/TW/Remittance/TWDOutWrdRmtAddRq/v1">  
  <soap:Header> 
    <v1:Header v1:mustUnderstand="true"> 
      <ChannelID>ESB</ChannelID>  
      <ServiceDomain>Remittance</ServiceDomain>  
      <OperationName>TWDOutWrdRmtAdd</OperationName>  
      <ConsumerID>TWESB</ConsumerID>  
      <TransactionID>T1222222</TransactionID>  
      <RqTimestamp>2015-12-06T12:01:01.00+08:00</RqTimestamp> 
    </v1:Header> 
  </soap:Header>  
  <soap:Body> 
    <v11:TWDOutWrdRmtAddRq> 
      <v11:ServiceHeader> 
        <v11:TxnId>RE01</v11:TxnId>  
        <v11:TxnNo>RE0100001</v11:TxnNo> 
      </v11:ServiceHeader>  
      <v11:Signon> 
        <v11:CustId>ESBUSER</v11:CustId> 
      </v11:Signon>  
      <v11:ServiceBody> 
        <v11:ChanId>APP</v11:ChanId>  
        <v11:TxnRefNo>100137892621001000</v11:TxnRefNo>  
        <v11:RmtDate>2019-12-21</v11:RmtDate>  
        <v11:RmtType>1111</v11:RmtType>  
        <v11:RmteeBank>090</v11:RmteeBank>  
        <v11:RmteeAcctNo>90093223</v11:RmteeAcctNo>  
        <v11:RmteeName>王小明</v11:RmteeName>  
        <v11:Amt>100000</v11:Amt>  
        <v11:RmterBank>822</v11:RmterBank>  
        <v11:RmterAcctNo>20129812</v11:RmterAcctNo>  
        <v11:RmterName>王小明</v11:RmterName>  
        <!--Optional:-->  
        <v11:RmtMemo>匯款</v11:RmtMemo>  
        <v11:BrchId>1234</v11:BrchId>  
        <!--Optional:-->  
        <v11:TlrId>USER001</v11:TlrId>  
        <!--Optional:-->  
        <v11:SprvsrId>ADM001</v11:SprvsrId> 
      </v11:ServiceBody> 
    </v11:TWDOutWrdRmtAddRq> 
  </soap:Body> 
</soap:Envelope>
